production_apps/OPENFOAM/motorBike96ACP/system/ensightWrite
// -*- C++ -*-
// Minimal example of using the ensight write function object.
// Many more options possible
ensightWrite
{
    type    ensightWrite;
    libs    ("libutilityFunctionObjects.so");
    log     true;

    // Fields to output (words or regex)
    fields  (U p "(k|epsilon|omega)");

    writeControl writeTime;
    writeIterval 1;
}

// ************************************************************************* //
